# 9.183 Даны 2 предложения. Напечатать слова, которые встречаются в двух предложениях только один раз.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# import functions
# someString = str(input('Введите строку: '))# Напечатать слова, которые встречаются в двух предложениях только один раз.
# someString2 = str(input('Введите строку: '))# Напечатать слова, которые есть только в одном из них
# functions.printWords(someString, someString2)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 9.182 Даны 2 предложения. Напечатать слова, которые есть только в одном из них
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# import functions
# someString = str(input('Введите строку: '))# Напечатать слова, которые встречаются в двух предложениях только один раз.
# someString2 = str(input('Введите строку: '))# Напечатать слова, которые есть только в одном из них
# functions.printWords2(someString, someString2)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 8.54 Дано натуральное число. Получить все простые делители этого числа.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# someInt = int(input('Введите число: '))
# someInt1 = 2
# simpleMatrix = [1]
# while someInt > 1:
#     if someInt % someInt1 == 0:
#         simpleMatrix.append(someInt1)
#         someInt = someInt // someInt1
#     someInt1 += 1
# someInt1 = [2, 5]
# for i in someInt1:
#     for j in simpleMatrix:
#         if j == 2 or j == 5:
#             continue
#         elif j % i == 0:
#             simpleMatrix.remove(j)
# print(simpleMatrix)  # при 101 [1, 101], 211 [1, 211], 210 [1,2,3,5,7], 213 [1,3,71]
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# 11.245 Дан массив. Переписать его элементы в другой массив такого же размера следующим образом: сначала должны идти
# все отрицательные элементы, а затем все остальные. Использовать только один проход по массиву
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# import random
# someInt = random.randint(1, 10)
# someMatr1 = [] * someInt
# for i in range(someInt):
#     someMatr1.append(random.randint(-50, 50))
# someMatr1.sort()
# for i in someMatr1:
#     print(i)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# Даны две матрицы. Написать функцию для нахождения суммы этих матриц.
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
# import random
# import functions
# someInt = random.randint(1, 10)
# someMatr1 = [[]] * someInt
# someMatr2 = [[]] * someInt
# for i in range(someInt):
#     someMatr1[i] = [0] * someInt
# for i in range(someInt):
#     someMatr2[i] = [0] * someInt
# for i in range(someInt):
#     for j in range(someInt):
#         someMatr1[i][j] = random.randint(1, 100)
#         someMatr2[i][j] = random.randint(1, 100)
# functions.summaMatric(someMatr1, someMatr2, someInt)
# ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
